app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "latitude", "location", "longitude", "receiver_desc", "sender_desc", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
	  @post = Post.new(post_params)
    respond_to do |format|
      if @post.save